#!  /bin/bash

# --------------------------------------------------------------------------------------
# crond  定时任务
# 查看定时任务的服务状态
# systemctl status crond.service
# 
# -------------------------------------------------------------------------------------- 
# crontab
#     -e edit
#     -l list
#     -r remove
# -------------------------------------------------------------------------------------- 
# crontab "* * * * *"
#     - 1*  一个小时中第几个分钟
#     - 2*  一天中的第几个小时
#     - 3*  一个月中的第几天
#     - 4*  一年中第几个月
#     - 5*  一周中的星期几
# 
#     特殊符号：
#         *   表示任何时间
#         ，  表示不连续的时间
#         -   表示连续时间段
#         *\n 表示每隔多久执行一次
# -------------------------------------------------------------------------------------

# 每隔一分钟向temp/cron_file.log 中追加一个 hello 并换行

1/* * * * * root echo "hello\n" >> temp/cron_file.log
