#!/usr/bin/bash

# -------------------------------------------------------------------------------------------------
# linux 使用挂载的方式分区，添加硬盘设备
# 语法
# -------------------------------------------------------------------------------------------------
# mount [-t vfstype(文件类型)] [-o option(挂载方式)] name(设备名称) dir(挂载的路径)
#     vfstype: 
#         -iso9660  
#         -msdos 
#         -vfat 
#         -ntfs 
#         -nfs
#     option:
#         -ro(readonly) 
#         -rw(readandwrite) 
#         -loop(mount a file as dev)
# 
# umount  path (mount path)
#
# -------------------------------------------------------------------------------------------------
# 注意事项：
# 挂载路径（挂载点）
# -------------------------------------
# 1、是一个已经存在的路径
# 2、不能被其他进程占用
# 3  文件夹中已经存在的文件在挂载之后将被隐藏

# 在命令行给定的挂载是只在本次开启的计算机会话中有效，设备重新启动后无效
# 要想挂载过程不需要手动进行，就需要将挂载过程写入文件中，每次开机自动挂载设备
# 
# vim /etc/fstab
# 
# 添加如下内容
# "name (devicename)              dir(mount path)           vfstype  default    0       0 "
# 

